app/controllers/api/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    render json: { events: Event.all}

INSERT INTO "events" ("date", "time", "title", "description", "location", "url", "image_url") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    newEvent = Event.create event_params