app/controllers/api/favorites_controller.rb

  def index
    render json: { faves: Favorite.all, user: current_user }
---
SELECT "favorites".* FROM "favorites"

  def create
    newFave = Favorite.create fave_params
---
INSERT INTO "favorites" ("event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 1], ["user_id", 1], ["created_at", "2016-06-02 17:59:25.902729"], ["updated_at", "2016-06-02 17:59:25.902729"]]