app/controllers/api/friendships_controller.rb

  def index
    render json: { faves: Friendship.all, user: current_user }
---
SELECT "friendships".* FROM "friendships"

  def create
    newFriend = Friendship.create friend_params
---
INSERT INTO "friendships" ("friend_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["friend_id", 1], ["user_id", 1], ["created_at", "2016-06-03 14:26:25.484179"], ["updated_at", "2016-06-03 14:26:25.484179"]]