app/views/users/favorites.html.erb

          <%@myFriends.each do |friend|%>
            <% friend.friend.favorites.each do |fave|%>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]