app/views/users/friends.html.erb

        <li><%= friend.friend.username%></li>
        <% friend.friend.favorites.each do |fave|%>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]