app/controllers/sessions_controller.rb

  def create
    # debugger
    # get the field from the form
    username = params[:username]
    password = params[:password]

    user = User.find_by username: username
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "sd"]]