app/controllers/users_controller.rb

  def create
    user = User.create user_params
---
INSERT INTO "users" ("username", "email", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["username", "lichard87"], ["email", "lichard@owls.com"], ["password_digest", "$2a$10$L75pzyRznGnU5aBoTTh0quyKwEMJ3ncFuglYMe8Tb2BpclDONVL4G"]]

  def find_friends
    render json: { users: User.all }
---
SELECT "users".* FROM "users"

  def find_faves
    myFaves = Favorite.where user_id: current_user.id
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 LIMIT 1  [["user_id", 1]]

  def favorites
    @myFaves = Favorite.where user_id: current_user.id
    @myFriends = Friendship.where user_id: current_user.id
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1  [["user_id", 1]]

  def friends
    @myFriends = Friendship.where user_id: current_user.id
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1  [["user_id", 1]]